test/resources/warn-no-abi.soap.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:EnquiryResponse xmlns:ns1="http://webservices.hpi.co.uk/CoreEnquiryV1">
			<ns1:RequestResults>
				<ns1:Asset>
					<ns1:AssetIdentification>
						<ns1:Vrm>RX10FXM</ns1:Vrm>
						<ns1:Vin>SDKRDKLD290051061</ns1:Vin>
						<ns1:Reference>REF1</ns1:Reference>
					</ns1:AssetIdentification>
					<ns1:PrimaryAssetData xsi:type="ns1:TranslatePlusAssetType">
						<ns1:DVLA>
							<ns1:Make>
								<ns1:Code>GE</ns1:Code>
								<ns1:Description>CATERHAM</ns1:Description>
							</ns1:Make>
							<ns1:Model>
								<ns1:Code>000</ns1:Code>
								<ns1:Description></ns1:Description>
							</ns1:Model>
							<ns1:Body>
								<ns1:Code>04</ns1:Code>
								<ns1:Description>Convertible</ns1:Description>
								<ns1:Colour>
									<ns1:NumberPreviousColours>0</ns1:NumberPreviousColours>
									<ns1:Current>
										<ns1:Code>F</ns1:Code>
										<ns1:Description>YELLOW</ns1:Description>
										<ns1:DateChanged xsi:nil="1" />
									</ns1:Current>
									<ns1:Previous xsi:nil="1" />
									<ns1:Original xsi:nil="1" />
								</ns1:Colour>
								<ns1:WheelPlan>
									<ns1:Code>C</ns1:Code>
									<ns1:Description>2 Axle Rigid Body</ns1:Description>
								</ns1:WheelPlan>
								<ns1:Weight>0</ns1:Weight>
							</ns1:Body>
							<ns1:Engine>
								<ns1:Size>1998</ns1:Size>
								<ns1:Number>M92539</ns1:Number>
								<ns1:Fuel>
									<ns1:Code>1</ns1:Code>
									<ns1:Description>Petrol</ns1:Description>
								</ns1:Fuel>
							</ns1:Engine>
							<ns1:Keepers xsi:nil="1"/>
							<ns1:KeyDates>
								<ns1:FirstRegistered>
									<ns1:Date>2010-05-10</ns1:Date>
									<ns1:VinVrmIndicator>
										<ns1:Code>1</ns1:Code>
										<ns1:Description>VRM</ns1:Description>
									</ns1:VinVrmIndicator>
								</ns1:FirstRegistered>
								<ns1:Manufactured>
									<ns1:Year>2010</ns1:Year>
								</ns1:Manufactured>
								<ns1:Scrapped xsi:nil="1" />
								<ns1:Exported xsi:nil="1" />
								<ns1:IsImported>false</ns1:IsImported>
							</ns1:KeyDates>
							<ns1:IsFromNorthernIreland>false</ns1:IsFromNorthernIreland>
						</ns1:DVLA>
						<ns1:SMMT xsi:nil="1" />
						<ns1:CrossReference xsi:nil="1" />
						<ns1:AdditionalInformation xsi:nil="1" />
						<ns1:TranslatePlus xsi:nil="1" />
					</ns1:PrimaryAssetData>
				</ns1:Asset>
				<ns1:Warning>
					<ns1:Product>HPI75</ns1:Product>
					<ns1:Code>326</ns1:Code>
					<ns1:Description>0 ABI recs returned - no ABI recs match to Vehicle Desc</ns1:Description>
				</ns1:Warning>
			</ns1:RequestResults>
		</ns1:EnquiryResponse>
	</soapenv:Body>
</soapenv:Envelope>
